Autodesk.Revit.DB.EntitlementExternalServiceUtils.ValidateUser
Validates user is either logged in or appropriate 2 legged context is set.
Returns:
True if validation succeeds.
Since:
2019

Autodesk.Revit.DB.EntitlementExternalServiceUtils.RegisterCloudModelUIServer(Autodesk.Revit.DB.ICloudModelUIServer)
Registers the application-wide cloud model UI external server.
server:
The object representing the cloud model UI external server.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2019

Autodesk.Revit.DB.EntitlementExternalServiceUtils.RegisterEntitlementExternalServer(Autodesk.Revit.DB.IEntitlementExternalServer)
Registers the application-wide entitlement external server.
server:
The object representing the entitlement external server.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2019

Autodesk.Revit.DB.EntitlementExternalServiceUtils.GetCloudModelUIServer
Returns the application-wide cloud model UI external server.
Returns:
The object representing the cloud model UI external server.
Since:
2019

Autodesk.Revit.DB.EntitlementExternalServiceUtils.GetEntitlementExternalServer
Returns the application-wide entitlement external server.
Returns:
The object representing the entitlement external server.
Since:
2019

Autodesk.Revit.DB.EntitlementExternalServiceUtils.EnsureToEnableCloudWorksharing
Shows a dialog for users to ensure if user really wants to enable cloud worksharing.
Returns:
Indicates whether the user really wants to enable cloud worksharing.
Since:
2019

Autodesk.Revit.DB.EntitlementExternalServiceUtils.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.EntitlementExternalServiceUtils
Utility class for EntitlementExternalService.
Since:
2019